:PROPERTIES:
:HEADER-ARGS: :var LIMIT=50
:END:
#+title: Dashboard


#+begin_src shell :shebang "#/usr/bin/env zsh" :results replace drawer
exec 2>&1
export LIMIT=20
~/bin/yadm status --porcelain |
    sed s,...,,\;1,${LIMIT:-10}\!d\;p |
    tr \\n \\0 |
    env -C ~ xargs -I %FILES% -0r find %FILES% -type f -maxdepth 0 -print0 |
    env -C ~ xargs -0 printf '[[file:%s][%s]]\n'
#+end_src

#+RESULTS:
:results:
find: ‘.config/doom/packages.el##template.j2cli,class.unstable’: No such file or directory
find: ‘.config/doom/packages.el##template.j2cli,class.unstable’: No such file or directory
[[file:.config/alacritty/alacritty.yml][.config/alacritty/alacritty.yml]]
[[file:.config/doom/.gitignore][.config/doom/.gitignore]]
[[file:.config/doom/config.el##template.j2cli,class.stable][.config/doom/config.el##template.j2cli,class.stable]]
[[file:.config/doom/config.el##template.j2cli,class.unstable][.config/doom/config.el##template.j2cli,class.unstable]]
[[file:.config/doom/dashboard.org][.config/doom/dashboard.org]]
[[file:.config/qutebrowser/autoconfig.yml][.config/qutebrowser/autoconfig.yml]]
[[file:.config/qutebrowser/bookmarks/urls][.config/qutebrowser/bookmarks/urls]]
[[file:.config/yadm/Makefile][.config/yadm/Makefile]]
[[file:.config/yadm/ansible-playbook.yml][.config/yadm/ansible-playbook.yml]]
[[file:.config/yadm/macro.j2][.config/yadm/macro.j2]]
[[file:.tmux.conf##class.stable][.tmux.conf##class.stable]]
[[file:bin/,][bin/,]]
:end:

#+begin_src shell :shebang "#/usr/bin/env zsh"
stdbuf -oL env -C $HOME -  fd -a  -tf -0 |
    sed -nE '/[\]]/d;p' |
    xargs -0 printf '[[file:%s][%s]]\n' |
    head
#+end_src

#+RESULTS:
| [[file:/home/geir/coreos.bu][/home/geir/coreos.ign]]                 |
| [[file:/home/geir/lynis-report.dat][/home/geir/lynis.log]]                  |
| [[file:/home/geir/gepr.gitconfig][/home/geir/start-sway.sh]]              |
| [[file:/home/geir/Dropbox/fedora-coreos-38.20230806.3.0-metal.x86_64.raw.xz][/home/geir/highlight.css]]              |
| [[file:/home/geir/remediation.yml][/home/geir/Documents/regnr.org]]        |
| [[file:/home/geir/Documents/scratch.org][/home/geir/Documents/anaconda-ks.cfg-]] |
| [[file:/home/geir/Documents/anaconda-ks.cfg][/home/geir/bin/autocommit.sh]]          |
| [[file:/home/geir/bin/xidel][/home/geir/bin/yadm]]                   |
| [[file:/home/geir/bin/,][/home/geir/go/bin/gitmux]]              |
| [[file:/home/geir/go/bin/regex2json][/home/geir/go/bin/pup]]                 |
